## Exercise 3.01: Mall Customer Segmentation - Understanding the Data

In [7]:
import numpy as np, pandas as pd
import matplotlib.pyplot as plt, seaborn as sns
%matplotlib inline

In [8]:
data0 = pd.read_csv("Mall_Customers.csv")
data0.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [9]:
data0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

#### Renaming columns

In [10]:
data0.rename({'Annual Income (k$)':'Income', 'Spending Score (1-100)':'Spend_score'}, axis=1, inplace=True)
data0.head()

   CustomerID  Gender  Age  Income  Spend_score
0           1    Male   19      15           39
1           2    Male   21      15           81
2           3  Female   20      16            6
3           4  Female   23      16           77
4           5  Female   31      17           40

In [11]:
data0.describe()

       CustomerID         Age      Income  Spend_score
count  200.000000  200.000000  200.000000   200.000000
mean   100.500000   38.850000   60.560000    50.200000
std     57.879185   13.969007   26.264721    25.823522
min      1.000000   18.000000   15.000000     1.000000
25%     50.750000   28.750000   41.500000    34.750000
50%    100.500000   36.000000   61.500000    50.000000
75%    150.250000   49.000000   78.000000    73.000000
max    200.000000   70.000000  137.000000    99.000000